devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
/** handling structure */
struct sdspi_data {
        mutex_t         *card_protect_mtx;
        card_type        card_type;
        bool             card_initialized;
        struct partition partition[4];
#if (SDSPI_ENABLE_DMA != 0)
        volatile bool    DMA_tansaction_finished;
#endif
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t         turn_on_SPI_clock       (void);
static stdret_t         turn_off_SPI_clock      (void);
static u8_t             send_cmd                (struct sdspi_data *sdspi, u8_t cmd, u32_t arg);
static u8_t             wait_ready              (void);
static u8_t             spi_rw                  (u8_t out);
static bool             receive_data_block      (u8_t *buff);
static bool             transmit_data_block     (const u8_t *buff, u8_t token);
static size_t           read_whole_sectors      (struct sdspi_data *hdl, void *dst, size_t nsectors, u64_t lseek);
static size_t           read_partial_sectors    (struct sdspi_data *hdl, void *dst, size_t size, u64_t lseek);
static size_t           write_whole_sectors     (struct sdspi_data *hdl, const void *src, size_t nsectors, u64_t lseek);
static size_t           write_partial_sectors   (struct sdspi_data *hdl, const void *src, size_t size, u64_t lseek);
static stdret_t         initialize_card         (struct sdspi_data *hdl);
static stdret_t         detect_partitions       (struct sdspi_data *hdl);
static size_t           card_read               (struct sdspi_data *hdl, u8_t *dst, size_t count, u64_t lseek);
static size_t           card_write              (struct sdspi_data *hdl, const u8_t *src, size_t count, u64_t lseek);

/*==============================================================================
  Local object definitions
==============================================================================*/
static struct sdspi_data *sdspi_data;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(SDSPI, void **device_handle, u8_t major, u8_t minor)
{
        STOP_IF(device_handle == NULL);
        UNUSED_ARG(major);
        UNUSED_ARG(minor);

        struct sdspi_data *sdspi;
        if (!(sdspi = calloc(1, sizeof(struct sdspi_data)))) {
                return STD_RET_ERROR;
        }

        *device_handle = sdspi;
        sdspi_data     = sdspi;

#if (SDSPI_ENABLE_DMA != 0)
        if ((u32_t)SDSPI_DMA == DMA1_BASE) {
                RCC->AHBENR |= RCC_AHBENR_DMA1EN;
        } else if ((u32_t)SDSPI_DMA == DMA2_BASE) {
                RCC->AHBENR |= RCC_AHBENR_DMA2EN;
        }

        NVIC_SetPriority(SDSPI_DMA_IRQ_NUMBER, SDSPI_DMA_IRQ_PRIORITY);
#endif

        if (!(sdspi->card_protect_mtx = mutex_new())) {
                goto error;
        }

        /* initialize SPI interface */
        if (turn_on_SPI_clock() != STD_RET_OK) {
                goto error;
        }

        enable_SS_output_in_master_mode();
        enable_unidirectional_data_mode();
        disable_hardware_CRC_calculation();
        enable_8_bit_data_frame();
        enable_software_slave_management();
        transmit_MSB_first();

#if   (SDSPI_PERIPHERAL_DIVIDER <=   2)
        set_baud_rate(FPCLK_DIV_2);
#elif (SDSPI_PERIPHERAL_DIVIDER <=   4)
        set_baud_rate(FPCLK_DIV_4);
#elif (SDSPI_PERIPHERAL_DIVIDER <=   8)
        set_baud_rate(FPCLK_DIV_8);
#elif (SDSPI_PERIPHERAL_DIVIDER <=  16)
        set_baud_rate(FPCLK_DIV_16);
#elif (SDSPI_PERIPHERAL_DIVIDER <=  32)
        set_baud_rate(FPCLK_DIV_32);
#elif (SDSPI_PERIPHERAL_DIVIDER <=  64)
        set_baud_rate(FPCLK_DIV_64);
#elif (SDSPI_PERIPHERAL_DIVIDER <= 128)
        set_baud_rate(FPCLK_DIV_128);
#else
        set_baud_rate(FPCLK_DIV_256);
#endif

        enable_master_mode();
        set_clock_polarity_to_0_when_idle();
        capture_on_first_edge();
        enable_SPI_peripheral();

        return STD_RET_OK;

error:
        if (sdspi) {
                if (sdspi->card_protect_mtx) {
                        mutex_delete(sdspi->card_protect_mtx);
                }

                free(sdspi);
        }
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(SDSPI, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        struct sdspi_data *hdl = device_handle;

        /* wait for all partition are released */
        int os_time = kernel_get_time_ms();
        while (  hdl->partition[0].in_use == true
              || hdl->partition[1].in_use == true
              || hdl->partition[2].in_use == true
              || hdl->partition[3].in_use == true) {

                if (os_time - kernel_get_time_ms() >= RELEASE_TIMEOUT_MS) {
                        errno = EBUSY;
                        return STD_RET_ERROR;
                }

                sleep_ms(100);
        }

        mutex_lock(hdl->card_protect_mtx, MAX_DELAY);
        critical_section_begin();
        mutex_unlock(hdl->card_protect_mtx);
        mutex_delete(hdl->card_protect_mtx);
        turn_off_SPI_clock();
        free(hdl);
        critical_section_end();

