devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                        while ((token = spi_rw(0xFF)) == 0xFF && --try);

                        if (token == 0xFE) {
                                u8_t *ptr = &csd[0];
                                for (int i = 0; i < 4; i++) {
                                        *ptr++ = spi_rw(0xFF);
                                        *ptr++ = spi_rw(0xFF);
                                        *ptr++ = spi_rw(0xFF);
                                        *ptr++ = spi_rw(0xFF);
                                }
                                spi_rw(0xFF);
                                spi_rw(0xFF);

                                /* SDC version 2.00 */
                                device_stat->st_size = 0;
                                if ((csd[0] >> 6) == 1) {
                                        int csize            = csd[9] + ((u16_t)csd[8] << 8) + 1;
                                        device_stat->st_size = (u64_t)csize << 10;
                                } else { /* SDC version 1.XX or MMC*/
                                        int n     = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                                        int csize = (csd[8] >> 6) + ((u16_t)csd[7] << 2) + ((u16_t)(csd[6] & 3) << 10) + 1;
                                        device_stat->st_size = (u64_t)csize << (n - 9);
                                }
                                device_stat->st_size *= SECTOR_SIZE;
                                device_stat->st_major = 0;
                                device_stat->st_minor = 0;
                        } else {
                                errno = EIO;
                        }
                } else {
                        errno = EIO;
                }

                mutex_unlock(hdl->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return status;
}

//==============================================================================
/**
 * @brief Function open new partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in]  flags            file open flags
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_open(void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

        struct partition *hdl = device_handle;

        if (hdl->in_use == true) {
                errno = EBUSY;
                return STD_RET_ERROR;
        } else {
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Function close partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in]  forced           force close
 * @param[in] *task             task which open file, valid if forced = true
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_close(void *device_handle, bool forced, const task_t *task)
{
        UNUSED_ARG(forced);
        UNUSED_ARG(task);
        STOP_IF(device_handle == NULL);

        struct partition *hdl = device_handle;

        hdl->in_use = false;
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function write data to partition file
 *
 * @param[in] *device_handle    handle to partition description
 * @param[in] *src              source
 * @param[in]  size             item size
 * @param[in]  count            bytes to write
 * @param[in] *fpos             file index
 *
 * @retval number of written bytes
 */
//==============================================================================
static ssize_t partition_write(void *device_handle, const u8_t *src, size_t count, u64_t *fpos)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);

        struct partition *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(sdspi_data->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_write(sdspi_data, src, count, *fpos + ((u64_t)hdl->first_sector * SECTOR_SIZE));
                mutex_unlock(sdspi_data->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief Function read data from partition file
 *
 * @param[in]  *device_handle   handle to partition description
 * @param[out] *dst             destination
 * @param[in]   count           bytes to read
 * @param[in]  *fpos            file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static ssize_t partition_read(void *device_handle, u8_t *dst, size_t count, u64_t *fpos)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);

        struct partition *hdl = device_handle;

        size_t n = 0;
        if (mutex_lock(sdspi_data->card_protect_mtx, MAX_DELAY) == MUTEX_LOCKED) {
                n = card_read(sdspi_data, dst, count, *fpos + ((u64_t)hdl->first_sector * SECTOR_SIZE));
                mutex_unlock(sdspi_data->card_protect_mtx);
        } else {
                errno = EBUSY;
        }

        return n;
}

//==============================================================================
/**
 * @brief Function control partition
 *
 * @param[in]    *device_handle         handle to partition description
 * @param[in]     iorq                  IO request
 * @param[in,out]*arg                   request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_ioctl(void *device_handle, int iorq, void *arg)
{
        STOP_IF(device_handle == NULL);
        UNUSED_ARG(iorq);
        UNUSED_ARG(arg);

        errno = EBADRQC;

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function flush partition
 *
 * @param[in] *device_handle           handle to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_flush(void *device_handle)
{
        STOP_IF(device_handle == NULL);

